tutorials/multiphase/multiphaseEulerFoam/laminar/bed/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    massSource
    {
        type            semiImplicitSource;

        timeStart       0;
        duration        1e6;

        selectionMode   points;
        points
        (
            (0.075 0.925 0.05)
        );

        volumeMode      absolute;

        sources
        {
            thermo:rho.water
            {
                explicit    1; // kg/s
                implicit    0;
            }
        }
    }
}


// ************************************************************************* //
